/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"One or more input fields are incorrect" = "Uno o más campos de entrada son incorrectos";
"is required" = "es requerido";
"doesn't match the required format" = "no coincide con el formato requerido";

// required fields text
"* Required Fields" = "* Campos obligatorios";

//buttons
"Cancel" = "Cancelar";
"More Information" = "Más información";
"OK" = "OK";
"Select" = "Seleccionar";

//default text
"default-title" = "";
"default-message" = "";
"Click for additional information" = "Haga clic para obtener información adicional";

"Confirm" = "Confirmar";
"Downloading" = "Descargando";

"confirmation failed  <br>values do not match" = "Error de confirmación <br>los valores no coinciden";

//constructor kit labels
"Welcome to the swiftDialog builder"            = "Bienvenido al constructor swiftDialog";
"Select properties on the left to modify. swiftDialog will update to show the changes in realtime"        = "Seleccione las propiedades a la izquierda para modificar. swiftDialog se actualizará para mostrar los cambios en tiempo real";
"Basic"              = "Básico";
"Content"            = "Contenido";
"Window"             = "Ventana";
"Sidebar"            = "Barra lateral";
"Data Entry"          = "Entrada de datos";
"Buttons"            = "Botones";
"Advanced"           = "Avanzado";
"List Items"          = "Artículos de la lista";
"Images"             = "Imágenes";
"Media"              = "Medios de comunicación";
"Output"             = "Producción";
"JSON Output"         = "Salida JSON";
"Quit"              = "Dejar";
"Export Command"      = "Comando de exportación";
"Title"              = "Título";
"Colour"             = "Color";
"Reset"              = "Reiniciar";
"Font Size: "           = "Tamaño de fuente: ";
"value:"              = "valor:";
"Message"           = "Mensaje";
"Text Alignment"      = "Alineación del texto";
"Vertical Position"   = "Posición vertical";
"Window Height"       = "Altura de la ventana";
"Height value:"        = "Valor de altura:";
"Window Width"        = "Ancho de ventana";
"Width value:"         = "Valor de ancho:";
"Window Properties"   = "Propiedades de la ventana";
"Preset Sizes"        = "Tamaños preestablecidos";
"Small"              = "Pequeña";
"Big"                = "Grande";
"Screen Background Blur"         = "Desenfoque de fondo de pantalla";
"Movable"            = "Móvil";
"Force on Top"         = "Fuerza en la cima";
"Progress Bar"        = "Barra de progreso";
"Progress value:"      = "Valor de progreso:";
"Progress Text:"       = "Texto de progreso:";
"Banner Image"        = "Imagen de la bandera";
"Select"             = "Seleccione";
"Watermark"          = "Filigrana";
"Fill"               = "Llenar";
"Opacity"              = "Alfa";
"Scale"              = "Escala";
"Position"           = "Posición";
"Icon"               = "Icono";
"Visible"            = "Visible";
"Centred"            = "Centrado";
"Select"             = "Seleccione";
"Icon Size"           = "Tamaño de ícono";
"Size value:"          = "Valor del tamaño:";
"Overlay"            = "Cubrir";
"Infobox"            = "Caja de información";
"Infotext"           = "Infotexto";
"Info Text"      = "Texto de información";
"Button1"            = "Botón 1";
"Button2"            = "Botón2";
"Info Button"    = "Botón de información";
"Quit on Info"         = "Salir en Información";
"Label: "              = "Etiqueta: ";
"Info Button Action: "   = "Acción del botón de información:";
"AutoPlay"           = "Auto-reproducción";
"Autoplay Seconds"    = "Segundos de reproducción automática";
"Path"               = "Camino";
"Caption"            = "Subtítulo";
"Status Text"         = "Texto de estado";
"Status"             = "Estado";
"Format output as JSON"         = "Formato de salida como JSON";
"Textfields"         = "Campos de texto";
"Show"               = "Show";
"Required"           = "Requerido";
"Secure"             = "Seguro";
"Prompt"             = "Oportuno";
"Regex"              = "regex";
"Regex Error"         = "Error de expresión regular";
"Select"             = "Seleccione";
"Checkbox"           = "Caja";
"Video"              = "Video";
"Filename"           = "Nombre del archivo";
"Web"                = "Web";
"URL"                = "URL";
"Disabled"           = "Discapacitado";
"Enabled"            = "Activado";
